//###########################################################################
//
// FILE:    hwbf_sent.h
//
// TITLE:   Definitions for the SENT registers.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef HWBF_SENT_H
#define HWBF_SENT_H

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>

//---------------------------------------------------------------------------
// SENT Individual Register Bit Definitions:

struct SENT_RCFG_BITS {                 // bits description
    uint16_t RX_ENB:1;                  // 0
    uint16_t RX_CRCENB:1;               // 1
    uint16_t RSVD_0:1;                  // 2
    uint16_t RX_PPENB:1;                // 3
    uint16_t RX_DNIB:4;                 // 7:4
    uint16_t CRC_WIDTH:2;               // 9:8
    uint16_t RX_CRC_WITH_STATUS:1;      // 10
    uint16_t RX_CRCTYPE:1;              // 11
    uint16_t RSVD:4;                    // 15:12
    uint16_t TTCLK:16;                  // 31:16
};

union SENT_RCFG_REG {
    uint32_t  all;
    struct  SENT_RCFG_BITS  bit;
};

struct SENT_RSDATA_BITS {               // bits description
    uint16_t CRC:6;                     // 5:0
    uint16_t RSVD:1;                    // 6
    uint16_t C:1;                       // 7
    uint32_t DATA:16;                   // 23:8
    uint16_t MESSAGEID:8;               // 31:24
};

union SENT_RSDATA_REG {
    uint32_t  all;
    struct  SENT_RSDATA_BITS  bit;
};

struct SENT_RSTAT_BITS {                // bits description
    uint16_t RXNIB:4;                   // 3:0
    uint16_t PP:1;                      // 4
    uint16_t RSVD:3;                    // 7:5
    uint16_t RXSLOW_ST:5;               // 12:8
    uint16_t RXSLOW_ACT:1;              // 13
    uint16_t RXSLOW_DN:1;               // 14
    uint16_t RX_SYNC:1;                 // 15
    uint16_t RX_TTCLK:16;               // 31:16
};

union SENT_RSTAT_REG {
    uint32_t  all;
    struct  SENT_RSTAT_BITS  bit;
};

struct SENT_RCFG2_BITS {                // bits description
    uint16_t FIFO_MODE:1;               // 0
    uint16_t DMA_ENB:1;                 // 1
    uint16_t TSTAMP_DIS:1;              // 2
    uint16_t NOWR_ERRDATA:1;            // 3
    uint16_t GFILT:8;                   // 11:4
    uint16_t RFIFO_TRIGLEV:4;           // 19:16
    uint16_t RSVD:3;                    // 15:13
    uint16_t MTP_MODE:1;                // 12
    uint16_t RSVD_0:12;                 // 31:20
};

union SENT_RCFG2_REG {
    uint32_t  all;
    struct  SENT_RCFG2_BITS  bit;
};

struct SENT_RINTFLAG_BITS {             // bits description
    uint16_t GLBL:1;                    // 0
    uint16_t RFAST_S1DV:1;              // 1
    uint16_t RFAST_S2DV:1;              // 2
    uint16_t RFAST_S3DV:1;              // 3
    uint16_t RFAST_S4DV:1;              // 4
    uint16_t RSLOW_DV:1;                // 5
    uint16_t RSLOW_CRCERR:1;            // 6
    uint16_t RSLOW_FORMATERR:1;         // 7
    uint16_t RFAST_S1CRCE:1;            // 8
    uint16_t RFAST_S2CRCE:1;            // 9
    uint16_t RFAST_S3CRCE:1;            // 10
    uint16_t RFAST_S4CRCE:1;            // 11
    uint16_t RFAST_S1FRME:1;            // 12
    uint16_t RFAST_S2FRME:1;            // 13
    uint16_t RFAST_S3FRME:1;            // 14
    uint16_t RFAST_S4FRME:1;            // 15
    uint16_t RTIMEOUT_ERR:4;            // 19:16
    uint16_t RFAST_SYNCERR25:1;         // 20
    uint16_t RFAST_SYNCERR:1;           // 21
    uint16_t FREQDRIFT_ERR:1;           // 22
    uint16_t RFIFO_TRIGGER:1;           // 23
    uint16_t RFIFO_OVFERR:1;            // 24
    uint16_t RFIFO_UNDFERR:1;           // 25
    uint16_t OVFTRIG_ERR:5;             // 30:26
    uint16_t RSVD:1;                    // 31
};

union SENT_RINTFLAG_REG {
    uint32_t  all;
    struct  SENT_RINTFLAG_BITS  bit;
};

struct SENT_REINT_BITS {                // bits description
    uint16_t RSVD:1;                    // 0
    uint16_t RSVD_1:1;                  // 31
    uint16_t RFAST_S2DV_E:1;            // 2
    uint16_t RFAST_S3DV_E:1;            // 3
    uint16_t RFAST_S4DV_E:1;            // 4
    uint16_t RSLOW_DV_E:1;              // 5
    uint16_t RSLOW_CRCERR_E:1;          // 6
    uint16_t RSLOW_FORMATERR_E:1;       // 7
    uint16_t RFAST_S1CRCE_E:1;          // 8
    uint16_t RFAST_S2CRCE_E:1;          // 9
    uint16_t RFAST_S3CRCE_E:1;          // 10
    uint16_t RFAST_S4CRCE_E:1;          // 11
    uint16_t RFAST_S1FRME_E:1;          // 12
    uint16_t RFAST_S2FRME_E:1;          // 13
    uint16_t RFAST_S3FRME_E:1;          // 14
    uint16_t RFAST_S4FRME_E:1;          // 15
    uint16_t RTIMEOUT_ERR_E:4;          // 19:16
    uint16_t RFAST_SYNCERR25_E:1;       // 20
    uint16_t RFAST_SYNCERR_E:1;         // 21
    uint16_t FREQDRIFT_ERR_E:1;         // 22
    uint16_t RFIFO_TRIGGER_E:1;         // 23
    uint16_t RFIFO_OVFERR_E:1;          // 24
    uint16_t RFIFO_UNDFERR_E:1;         // 25
    uint16_t OVFTRIG_ERR_E:5;           // 30:26
    uint16_t RFAST_S1DV_E:1;            // 1
};

union SENT_REINT_REG {
    uint32_t  all;
    struct  SENT_REINT_BITS  bit;
};

struct SENT_RSETINT_BITS {              // bits description
    uint16_t RSVD_0:1;                  // 31
    uint16_t RFAST_S1DV_S:1;            // 1
    uint16_t RFAST_S2DV_S:1;            // 2
    uint16_t RFAST_S3DV_S:1;            // 3
    uint16_t RFAST_S4DV_S:1;            // 4
    uint16_t RSLOW_DV_S:1;              // 5
    uint16_t RSLOW_CRCERR_S:1;          // 6
    uint16_t RSLOW_FORMATERR_S:1;       // 7
    uint16_t RFAST_S1CRCE_S:1;          // 8
    uint16_t RFAST_S2CRCE_S:1;          // 9
    uint16_t RFAST_S3CRCE_S:1;          // 10
    uint16_t RFAST_S4CRCE_S:1;          // 11
    uint16_t RFAST_S1FRME_S:1;          // 12
    uint16_t RFAST_S2FRME_S:1;          // 13
    uint16_t RFAST_S3FRME_S:1;          // 14
    uint16_t RFAST_S4FRME_S:1;          // 15
    uint16_t RTIMEOUT_ERR_S:4;          // 19:16
    uint16_t RFAST_SYNCERR25_S:1;       // 20
    uint16_t RFAST_SYNCERR_S:1;         // 21
    uint16_t FREQDRIFT_ERR_S:1;         // 22
    uint16_t RFIFO_TRIGGER_S:1;         // 23
    uint16_t RFIFO_OVFERR_S:1;          // 24
    uint16_t RFIFO_UNDFERR_S:1;         // 25
    uint16_t OVFTRIG_ERR_S:5;           // 30:26
    uint16_t RSVD:1;                    // 0
};

union SENT_RSETINT_REG {
    uint32_t  all;
    struct  SENT_RSETINT_BITS  bit;
};

struct SENT_RCLRINT_BITS {              // bits description
    uint16_t GLBL_CLR:1;                // 0
    uint16_t RFAST_S1DV_CLR:1;          // 1
    uint16_t RFAST_S2DV_CLR:1;          // 2
    uint16_t RFAST_S3DV_CLR:1;          // 3
    uint16_t RFAST_S4DV_CLR:1;          // 4
    uint16_t RSLOW_DV_CLR:1;            // 5
    uint16_t RSLOW_CRCERR_CLR:1;        // 6
    uint16_t RSLOW_FORMATERR_CLR:1;     // 7
    uint16_t RFAST_S1CRCE_CLR:1;        // 8
    uint16_t RFAST_S2CRCE_CLR:1;        // 9
    uint16_t RFAST_S3CRCE_CLR:1;        // 10
    uint16_t RFAST_S4CRCE_CLR:1;        // 11
    uint16_t RFAST_S1FRME_CLR:1;        // 12
    uint16_t RFAST_S2FRME_CLR:1;        // 13
    uint16_t RFAST_S3FRME_CLR:1;        // 14
    uint16_t RFAST_S4FRME_CLR:1;        // 15
    uint16_t RTIMEOUT_ERR_CLR:4;        // 19:16
    uint16_t RFAST_SYNCERR25_CLR:1;     // 20
    uint16_t RFAST_SYNCERR_CLR:1;       // 21
    uint16_t FREQDRIFT_ERR_CLR:1;       // 22
    uint16_t RFIFO_TRIGGER_CLR:1;       // 23
    uint16_t RFIFO_OVFERR_CLR:1;        // 24
    uint16_t RFIFO_UNDFERR_CLR:1;       // 25
    uint16_t OVFTRIG_ERR_CLR:5;         // 30:26
    uint16_t RSVD:1;                    // 31
};

union SENT_RCLRINT_REG {
    uint32_t  all;
    struct  SENT_RCLRINT_BITS  bit;
};

struct SENT_CSENT_SWR_BITS {            // bits description
    uint16_t SWR:1;                     // 0
    uint32_t RSVD:31;                   // 31:1
};

union SENT_CSENT_SWR_REG {
    uint32_t  all;
    struct  SENT_CSENT_SWR_BITS  bit;
};

struct SENT_DATA0_MAP_BITS {            // bits description
    uint16_t D0_NIB0:4;                 // 3:0
    uint16_t D0_NIB1:4;                 // 7:4
    uint16_t D0_NIB2:4;                 // 11:8
    uint16_t D0_NIB3:4;                 // 15:12
    uint16_t D0_NIB4:4;                 // 19:16
    uint16_t D0_NIB5:4;                 // 23:20
    uint16_t D0_NIB6:4;                 // 27:24
    uint16_t D0_NIB7:4;                 // 31:28
};

union SENT_DATA0_MAP_REG {
    uint32_t  all;
    struct  SENT_DATA0_MAP_BITS  bit;
};

struct SENT_DATA1_MAP_BITS {            // bits description
